Progetto/tsung/ws_load.xml
<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE tsung SYSTEM "/usr/local/Cellar/tsung/1.7.0/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0" dumptraffic="light">
	<clients>
		<client host="localhost" use_controller_vm="true" maxusers="100000" />
	</clients>

	<servers>
		<server host="localhost" port="5000" type="tcp" />
	</servers>

	<load>
		<arrivalphase phase="1" duration="300" unit="second">
			<users arrivalrate="3" unit="second" />
		</arrivalphase>
	</load>

	<options>
		<option type="ts_http" name="user_agent">
			<user_agent probability="80">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
			<user_agent probability="20">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
		</option>
	</options>

	<sessions>
		<session name="compile_and_execute_primes" probability="100" type="ts_http">
			<!-- current time -->
			<setdynvars sourcetype="eval" code="fun({Pid,DynVars})->
        {M, S, _} = os:timestamp(),
        M * 1000000 + S end.">
				<var name="timestamp" />
			</setdynvars>

			<!-- random number -->
			<setdynvars sourcetype="random_number" start="0" end="9999">
  			<var name="rndint" />
			</setdynvars>

			<!-- handshaking over HTTP -->
			<transaction name="_socket_connected">
				<request subst="true">
					<dyn_variable name="sid" re="sid&quot;:&quot;([a-zA-Z0-9_.-]+)&quot;" />
					<http url="/socket.io/?EIO=4&amp;transport=polling&amp;t=%%_timestamp%%000-%%_rndint%%-0" method="GET" version="1.1" contents=""></http>
				</request>

				<request subst="true">
					<http url="/socket.io/?EIO=4&amp;transport=polling&amp;t=%%_timestamp%%000-%%_rndint%%-1&amp;sid=%%_sid%%" method="POST" version="1.1" contents="40"></http>
				</request>

				<request subst="true">
					<http url="/socket.io/?EIO=4&amp;transport=polling&amp;t=%%_timestamp%%000-%%_rndint%%-2&amp;sid=%%_sid%%" method="GET" version="1.1" contents=""></http>
				</request>
			</transaction>

			<!-- wait up to 5 seconds -->
	    <thinktime value="5" random="true"/>

			<!-- socket response are retrieved simulating a socket polling - max 30 messages -->
			<!-- http request is blocked by socket.io until a message is available or reach timeout -->
			<!-- so with this polling we are not killing the balancer -->

			<!-- send compile request -->
			<transaction name="_request_handled">
				<request subst="true">
					<dyn_variable name="message_handled" re="&quot;(handled)&quot;" />
					<dyn_variable name="error_status" re="&quot;(error)&quot;" />
					<dyn_variable name="bad_request" re="(400 Bad Request)" />

					<http url="/socket.io/?transport=polling&amp;t=%%_timestamp%%000-%%_rndint%%-3&amp;sid=%%_sid%%" method="POST" version="1.1" contents="42[&quot;compilationRequest&quot;,&quot;I2luY2x1ZGUgPGlvc3RyZWFtPgp1c2luZyBuYW1lc3BhY2Ugc3RkOwoKYm9vbCBpc1ByaW1lKGludCBuKXsKCWlmIChuPT0xIHx8IG49PTApIHJldHVybiBmYWxzZTsKCglmb3IgKGludCBpPTI7IGkgPCBuOyBpKyspewoJCWlmKG4laSA9PSAwKSByZXR1cm4gZmFsc2U7Cgl9CgkKICByZXR1cm4gdHJ1ZTsKfQoKCmludCBtYWluKCkgewogIGludCBOID0gMjE0NzQ4MzY0NzsKICBpbnQgY250ID0gMDsKCglmb3IgKGludCBpPTE7IGkgPD0gTjsgaSsrKXsKCQlpZiAoaXNQcmltZShpKSkgewoJCQljbnQrKzsKCQl9Cgl9CgogIGNvdXQgPDwgIkZvdW5kICIgPDwgY250IDw8ICIgcHJpbWUgbnVtYmVycyI7CgoJcmV0dXJuIDA7Cn0K&quot;,&quot;&quot;,[],true]"></http>
				</request>

				<!-- Abort on error -->
				<if var="error_status" eq="error">
					<abort />
				</if>

				<!-- Abort on Bad Request -->
				<if var="bad_request" eq="400 Bad Request">
					<abort />
				</if>

				<if var="message_handled" neq="handled">
					<repeat name="l_handled_1" max_repeat="60">
						<!-- Abort on error-->
						<if var="error_status" eq="error">
							<abort />
						</if>

						<!-- Abort on Bad Request -->
						<if var="bad_request" eq="400 Bad Request">
							<abort />
						</if>

						<request subst="true">
							<dyn_variable name="message_handled" re="&quot;(handled)&quot;" />
							<dyn_variable name="error_status" re="&quot;(error)&quot;" />
							<dyn_variable name="bad_request" re="(400 Bad Request)" />

							<http url="/socket.io/?EIO=4&amp;transport=polling&amp;t=%%_timestamp%%000-%%_rndint%%-4&amp;sid=%%_sid%%&amp;mh=%%_message_handled%" method="GET" version="1.1"></http>
						</request>

						<!-- Repeat until handled result -->
						<while var="message_handled" neq="handled" />
					</repeat>
				</if>
			</transaction>

			<!-- wait for execution result -->
			<transaction name="_request_executed">
				<repeat name="l_execute_1" max_repeat="60">
					<!-- Abort on error-->
					<if var="error_status" eq="error">
						<abort />
					</if>

					<!-- Abort on Bad Request -->
					<if var="bad_request" eq="400 Bad Request">
						<abort />
					</if>

					<request subst="true">
						<dyn_variable name="action_execute" re="&quot;action\\&quot;:\\&quot;([a-zA-Z0-9_.-]+)\\&quot;" />
						<dyn_variable name="error_status" re="&quot;(error)&quot;" />
						<dyn_variable name="bad_request" re="(400 Bad Request)" />

						<http url="/socket.io/?EIO=4&amp;transport=polling&amp;t=%%_timestamp%%000-%%_rndint%%-5&amp;sid=%%_sid%%&amp;ae=%%_action_execute%" method="GET" version="1.1"></http>
					</request>

					<!-- Repeat until EXECUTE result -->
					<while var="action_execute" neq="EXECUTE" />
				</repeat>
			</transaction>
		</session>
	</sessions>
</tsung>